app/controllers/home_controller.rb

  def index
    if current_user.current_deck.present?
      @card = current_user.current_deck.cards.for_review.first
---
SELECT  "cards".* FROM "cards" WHERE (review_date <='2015-04-28 15:34:11.530144')  ORDER BY RANDOM() LIMIT 1

  def review_card
    @card = Card.find(translation_params[:id])
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 1]]